Repository: jmavlonov/jasur-mavlonov-bio
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Home
uz: Bosh sahifa

source: About
uz: Men haqimda

source: Technical Skills
uz: Texnik ko‘nikmalar

source: Contact
uz: Aloqa

source: The WebShala Template
uz: WebShala shabloni

source: Python Backend Engineer | Expert in Django & FastAPI
uz: Python Backend Dasturchisi | Django va FastAPI bo‘yicha mutaxassis

source: Building Scalable APIs and Database-Driven Applications
uz: Kengaytiriladigan API va ma’lumotlar bazasiga asoslangan ilovalarni yaratish

source: About Me
uz: Men haqimda

source: I'm Jasur Mavlonov.
uz: Men Jasur Mavlonovman.

source: Web Developer
uz: Veb dasturchi

source: I am a Python Backend Developer with over 2 years of experience designing and building scalable backend systems. I specialize in developing RESTful APIs using Django and FastAPI, implementing efficient database structures and optimizations, and working with Celery and Redis for background task processing. My expertise also includes building microservice architectures and integrating various backend components to deliver high-performance, maintainable applications.
uz: Men 2 yildan ortiq tajribaga ega Python Backend dasturchiman. Django va FastAPI yordamida kengaytiriladigan RESTful API larni ishlab chiqish, ma’lumotlar bazalarini samarali tuzish va optimallashtirish, shuningdek, Celery va Redis orqali fon jarayonlarini tashkil etish bilan shug‘ullanaman. Shuningdek, mikroxizmatlar arxitekturasi yaratish va backend tizimlarini integratsiya qilishda tajribaga egaman.

source: Experience
uz: Tajriba

source: Backend Developer
uz: Backend dasturchi

source: I have developed a dashboard page that consolidates all microservices into a single interface. It includes a login system, search functionality, and a customized version of the default Django admin templates.
uz: Barcha mikroxizmatlarni yagona interfeysga birlashtiruvchi boshqaruv paneli yaratdim. U login tizimi, qidiruv funksiyasi va Django admin shablonlarining moslashtirilgan versiyasini o‘z ichiga oladi.

source: Python Mentor
uz: Python mentori

source: Developed a full-featured e-commerce platform with product listings, shopping cart, order management, and secure payment integration. Implemented using Django REST Framework and optimized for performance.
uz: Mahsulotlar ro‘yxati, savat tizimi, buyurtmalar boshqaruvi va xavfsiz to‘lov tizimiga ega to‘liq funksional e-commerce platformasini ishlab chiqdim. Django REST Framework asosida yaratilgan va ishlash tezligi optimallashtirilgan.

source: Built an online shop with product catalog, cart system, order tracking, and user authentication. Developed using Django and integrated with a responsive front-end for a smooth shopping experience.
uz: Mahsulot katalogi, savat, buyurtma kuzatuvi va foydalanuvchi autentifikatsiyasi mavjud onlayn do‘kon yaratdim. Django yordamida ishlab chiqilgan va qulay front-end bilan integratsiya qilingan.

source: Education
uz: Ta’lim

source: Bachelor’s degree in Information Security, focusing on network security, cryptography, and secure software development.
uz: Axborot xavfsizligi yo‘nalishida bakalavr darajasi. Tarmoq xavfsizligi, kriptografiya va xavfsiz dasturiy ta’minot ishlab chiqish yo‘nalishlariga ixtisoslashgan.

source: Programming Languages
uz: Dasturlash tillari

source: Databases
uz: Ma’lumotlar bazalari

source: Frameworks
uz: Freymvorklar

source: Task Queues & Messaging
uz: Vazifalar navbati va xabar almashish

source: DevOps & Deployment
uz: DevOps va joylashtirish

source: Version Control
uz: Versiya boshqaruvi

source: Soft Skills
uz: Shaxsiy ko‘nikmalar

source: Team Collaboration
uz: Jamoada ishlash

source: Debugging & Troubleshooting
uz: Xatolarni topish va tuzatish

source: DevOps Collaboration
uz: DevOps bilan hamkorlik

source: Web Development
uz: Veb dasturlash

source: Tech:
uz: Texnologiyalar:

source: View Project
uz: Loyihani ko‘rish

source: Latest Blog
uz: So‘nggi maqolalar

source: Building a RESTful API with Django Rest Framework
uz: Django Rest Framework yordamida RESTful API yaratish

source: Creating a RESTful API using Django Rest Framework is the foundation of modern backend projects. In this post, we’ll learn how to work with authentication, serializers, and viewsets.
uz: Django Rest Framework yordamida RESTful API yaratish — zamonaviy backend loyihalarining asosi. Ushbu postda authentication, serializer va viewset’lar bilan ishlashni o‘rganamiz.

source: Tags:
uz: Teglar:

source: Deploying Django App with Docker and Nginx
uz: Django ilovasini Docker va Nginx yordamida joylashtirish

source: By deploying your Django project inside a Docker container, you can create a stable and flexible deployment system. In this article, we’ll explore a real-world configuration using Nginx, Gunicorn, and Docker Compose.
uz: Django loyihangizni Docker konteynerida joylashtirish orqali barqaror va moslashuvchan deploy tizimini yaratish mumkin. Ushbu maqolada Nginx, Gunicorn va Docker Compose bilan haqiqiy konfiguratsiyani ko‘rib chiqamiz.

source: Optimizing Python Code for Better Performance
uz: Python kodini samaradorlik uchun optimallashtirish

source: When working with large amounts of data, your Python application may run slowly. In this article, we’ll explore how to improve backend performance using profiling, caching, and asynchronous technologies.
uz: Katta hajmdagi ma’lumotlar bilan ishlaganda Python dasturingiz sekin ishlashi mumkin. Ushbu maqolada profiling, caching va asinxron texnologiyalar yordamida backend tezligini qanday oshirish mumkinligini ko‘rib chiqamiz.

source: Contact Me
uz: Menga yozing

source: Location
uz: Manzil

source: Email
uz: Elektron pochta

source: Name
uz: Ism

source: Your Message...
uz: Xabaringiz...

source: Send Message
uz: Xabarni yuborish

source: Style Switcher
uz: Uslub almashtirgich

source: Body Skin
uz: Tana rejimi

source: Light
uz: Yorug‘

source: Dark
uz: Qorong‘i
